#include <stdio.h>

int main() {
    int p1 = 1, *p2, **p3, ***p4, ****p5, *****p6, ******p7;
    p2 = &p1;
    p3 = &p2;
    p4 = &p3;
    p5 = &p4;
    p6 = &p5;
    p7 = &p6;
    printf("%d", p1);
    printf("%d", *p2);
    printf("%d", **p3);
    printf("%d", ***p4);
    printf("%d", ****p5);
    printf("%d", *****p6);
    printf("%d", ******p7);
    //最终输出来的结果都是:1
    // 对于多级指针，总结来说就是，以二级指针为例子，定义一个指针，这个指针指向一个指针的地址，
    // 而被指向的指针指向的是一个数据的地址，所以二级指针通过指向一级指针地址指向了一个数据的地址，
    // 进而可以使二级指针也能表示出这个数据的值。说到底，多级指针就是无限套娃。



    //  char *str1[] = {"abc", "mike",  "hello"}; //指针数组
    //  int (*str2)[10]; //数组指针

    return 0;
}