#include <stdio.h>
#include <malloc.h>
#include <string.h>

void func1(char *dst) {
    *dst = 'c';
}

void func2(char *dst) {
    *dst = 'c';
}



int main() {
    ////////////////////////////////////////////////////////////
    /// char* s22 = "123"; //对于这样声明的字符创，编译器会自动在末位加上'\0'
    /// func2(s22); //将会报错，段错误，因为这样声明的是一个字符串常量，只可读，禁止写；
    /// puts(s22);

    ////////////////////////////////////////////////////////////
    char s11[] = {'1', '2', '3', '\0'};
    func1(s11); //可以将s11指向的内存区域，第一个字节，修改为'c';
    puts(s11); //打印：c23
    return 0;
}